:PROPERTIES:
:ID:       3d2330da-5a95-408a-b940-7d2b3b0c7fb2
:END:
#+TITLE: Keyboard
#+DESCRIPTION: Info on keyboards, whether x11/wayland or software/hardware or just docs
#+TAGS:



**** Determining what XKB version Kwin is built with

I don't have control over how Arch has built KWin, so even though it accepts
=libxkbcommon= as a dependency, I think many of the wayland libraries are a
static dependency, esp. the closer you get to the compositor. The dependencies
are between four and eight levels deep, but =libxkbcommon= is a direct
dependency of =qt5-base= ... which you need to rebuild your whole system:
[[https://aur.archlinux.org/packages/qt5-base-git][Required by (2934)]]. So basically, I'm not sure I want to do that, being on a
custom flavor of arch.

#+begin_src sh :results output pp
pactree  -r libxkbcommon | grep kwin
#+end_src

#+RESULTS:
: │ │ │     ├─kwin-bismuth-git
: │ │ │   │   └─kwin
: │ │ │   │     ├─kwin-effects-sliding-notifications
: │ │ │   │     ├─kwin-scripts-forceblur
: │ │ │ │ │ │ │ │ └─kwin
: │ │ │ │ │ │ │ │ └─kwin
: │ │ │ │ │ │ │ │ ├─kwin
: │ │ │ └─kwin
: │ │ │ ├─kwindowsystem

Nevermind, these are all dynamic.

#+begin_example asm
lines from buffer: kwin_wayland
Symbol table '.dynsym' contains 2100 entries:
   Num:    Value          Size Type    Bind   Vis      Ndx Name
    225:   221: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN4KWin6Effect20grabbedKeyboardEventEP9QKeyEvent
    412:   408: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZNK20QPlatformIntegration22queryKeyboardModifiersEv@Qt_5_PRIVATE_API (4)
    653:   649: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZNK14KWaylandServer13SeatInterface8keyboardEv
    856:   852: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN14KWaylandServer13SeatInterface35focusedKeyboardSurfaceAboutToChangeEPNS_16SurfaceInterfaceE
   1000:   996: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZNK4KWin24KeyboardInputRedirection3xkbEv
   1167:  1163: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN14KWaylandServer17KeyboardInterface7sendKeyEjNS_16KeyboardKeyStateEPNS_16ClientConnectionE
   1209:  1205: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN4KWin14EffectsHandler12mouseChangedERK6QPointS3_6QFlagsIN2Qt11MouseButtonEES7_S4_INS5_16KeyboardModifierEES9_
   1305:  1301: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZNK14KWaylandServer17KeyboardInterface14focusedSurfaceEv
   1316:  1312: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN14KWaylandServer17KeyboardInterface13sendModifiersEjjjj
   1869:  1865: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN4KWin16QuickSceneEffect20grabbedKeyboardEventEP9QKeyEvent
   1875:  1871: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZN15QPlatformWindow22setKeyboardGrabEnabledEb@Qt_5_PRIVATE_API (4)
   1980:  1976: 0000000000000000     0 FUNC    GLOBAL DEFAULT  UND _ZNK14QPlatformTheme11keyBindingsEN12QKeySequence11StandardKeyE@Qt_5_PRIVATE_API (4)
#+end_example



